zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_lib.h
/** Declares touch structure used to store positions of Touchpad, Matrix buttons, Slider and
 *  Liquid Level widgets */
typedef struct
{
    cy_stc_capsense_position_t * ptrPosition;       /**< Pointer to the array containing the position information. 
                                                         A number of elements is defined by numPosition. */
    uint8_t numPosition;                            /**< Total number of detected touches on a widget:
                                                    *    * 0 - no touch is detected 
                                                    *    * 1 - a single touch is detected
                                                    *    * 2 - two touches are detected
                                                    *    * 3 - three touches are detected
                                                    *    * CY_CAPSENSE_POSITION_MULTIPLE - multiple touches are detected 
                                                    *        and information in position structure should be ignored.
                                                    *
                                                    * The below table specifies a number of touches could be reported for a specific widget.
                                                    * <table class="doxtable">
                                                    *    <tr>
                                                    *      <th colspan="2">CAPSENSE</th>
                                                    *      <th colspan="5">Number of positions</th>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *       <td>Sensing method</td>
                                                    *       <td>Widget type</td>
                                                    *       <td>0</td>
                                                    *       <td>1</td>
                                                    *       <td>2</td>
                                                    *       <td>&emsp;&emsp;3&emsp;&emsp;</td>
                                                    *       <td>Multiple</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td rowspan="6">CSD</td>
                                                    *      <td>Button</td>
                                                    *      <td rowspan="10">&emsp;No touch&emsp; <br> &emsp;detected&emsp;</td>
                                                    *      <td colspan="3">Number of active sensors <br> (up to number of sensors)</td>
                                                    *      <td>N/A</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td>Matrix button</td>
                                                    *      <td>Single touch <br> detected</td>
                                                    *      <td>N/A</td>
                                                    *      <td>N/A</td>
                                                    *      <td>Multiple touches <br>  detected</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td>Linear slider</td>
                                                    *      <td>Single touch <br> detected</td>
                                                    *      <td>N/A</td>
                                                    *      <td>N/A</td>
                                                    *      <td>N/A</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td>Radial slider</td>
                                                    *      <td>Single touch <br> detected</td>
                                                    *      <td>N/A</td>
                                                    *      <td>N/A</td>
                                                    *      <td>N/A</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td>Touchpad</td>
                                                    *      <td>Single touch <br> detected</td>
                                                    *      <td>Two touches <br> detected</td>
                                                    *      <td>N/A</td>
                                                    *      <td>Multiple touches <br> detected</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td>Proximity</td>
                                                    *      <td colspan="3">Number of active sensors <br> (up to number of sensors)</td>
                                                    *      <td>N/A</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td rowspan="4">CSX</td>
                                                    *      <td>Button</td>
                                                    *      <td colspan="3">Number of active sensors <br> (up to number of sensors)</td>
                                                    *      <td>N/A</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td>Matrix button</td>
                                                    *      <td colspan="3">Number of active sensors <br> (up to number of sensors)</td>
                                                    *      <td>N/A</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td>Linear slider</td>
                                                    *      <td>Single touch <br> detected</td>
                                                    *      <td>N/A</td>
                                                    *      <td>N/A</td>
                                                    *      <td>N/A</td>
                                                    *    </tr>
                                                    *    <tr align="center">
                                                    *      <td>Touchpad</td>
                                                    *      <td colspan="3">Number of touches <br> (up to 3)</td>
                                                    *      <td>N/A</td>
                                                    *    </tr>
                                                    * </table>
                                                    */
} cy_stc_capsense_touch_t;

