zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_lib.h
/*******************************************************************************
* Function Name: Cy_CapSense_TuneSensitivity_Lib
****************************************************************************//**
*
* Configure scanning resolution to achieve the sufficient sensitivity.
*
* This function requires non-zero Modulator IDAC code (if IDAC is equal to zero it 
* is considered as non-valid use case).
*
* \param config
* The configuration structure.
*
* \return 
* Scan resolution
*
*******************************************************************************/
uint8_t Cy_CapSense_TuneSensitivity_Lib(
                cy_stc_capsense_auto_tune_config_t * config);

/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseCapacitance
****************************************************************************//**
*
* Returns capacitance that corresponds to the provided parameters.
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns capacitance in femto-farads.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseCapacitance(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseFrequencyDivider
****************************************************************************//**
*
* Returns minimum sense clock divider.
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns sense clock divider.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseFrequencyDivider(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseNumSubconversions
****************************************************************************//**
*
* Returns optimum number of sub-conversions.
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns number of sub-conversions.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseNumSubconversions(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/*******************************************************************************
* Function Name: Cy_CapSense_UpdateThresholds_Lib
****************************************************************************//**
*
* Updates noise and finger thresholds for a specified widget.
*
* This function comprises an algorithm of thresholds auto-tune. The thresholds
* object contains updated thresholds after this API is called.
*
* \param ptrNoiseEnvelope 
* The pointer to the noise-envelope object in RAM.
*
* \param ptrThresholds    
* The pointer to the thresholds object.
*
* \param sigPFC           
* Signal per touch sensitivity.
*
* \param startFlag           
* The flag indicates a first sensor in a widget.
*
*******************************************************************************/
void Cy_CapSense_UpdateThresholds_Lib(
                const cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNoiseEnvelope,
                cy_stc_capsense_smartsense_update_thresholds_t * ptrThresholds,
                uint16_t sigPFC,
                uint32_t startFlag);

/*******************************************************************************
* Function Name: Cy_CapSense_InitializeNoiseEnvelope_Lib
****************************************************************************//**
*
* Initializes the noise-envelope filter.
*
* \param rawCount         
* The RawCount value for a given sensor.
*
* \param sigPFC           
* Signal per finger capacitance.
*
* \param ptrNoiseEnvelope 
* The pointer to the noise-envelope RAM object of the sensor.
*
*******************************************************************************/
void Cy_CapSense_InitializeNoiseEnvelope_Lib(
                uint16_t rawCount,
                uint16_t sigPFC,
                cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNoiseEnvelope);

/*******************************************************************************
* Function Name: Cy_CapSense_RunNoiseEnvelope_Lib
****************************************************************************//**
*
* Runs the noise-envelope filter.
*
* \param rawCount         
* The RawCount value for a given sensor.
*
* \param sigPFC           
* Signal per touch sensitivity.
*
* \param ptrNoiseEnvelope 
* The pointer to the noise-envelope RAM object of the sensor.
*
*******************************************************************************/
void Cy_CapSense_RunNoiseEnvelope_Lib(
                uint16_t rawCount,
                uint16_t sigPFC,
                cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNoiseEnvelope);

/*******************************************************************************
* Function Name: Cy_CapSense_GetLiquidLevel
****************************************************************************//**
*
* Calculates liquid level.
*
* \param ptrLlwConfig
* Specifies the pointer to liquid level configuration.
*
* \param ptrLlwContext
* Specifies the pointer to sensor context structure which belongs to the
* desired widget.
*
* \return
* Returns a calculated liquid level in range
* from 0 to 2 ^ CY_CAPSENSE_LLW_RESULT_SHIFT and liquid level tank detection
* status (CY_CAPSENSE_WD_TANK_REMOVAL_DETECTION_MASK) or CY_CAPSENSE_LLW_NOT_VALID_DATA
* when liquid level calculation has not finished successfully.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetLiquidLevel_Lib(
                const uint8_t * ptrLlwConfig,
                const uint16_t * ptrLlwContext);

/*******************************************************************************
* Function Name: Cy_CapSense_CommonModeFilter_Lib
****************************************************************************//**
*
* Applies common mode filter to all sensors inside a desired widget.
*
* \param cmfThreshold
* Specifies the common mode filter threshold.
*
* \param numSns
* Specifies the number of sensors in a desired widget.
*
* \param ptrSnsContext
* Specifies the pointer to the sensor context structure. The structure size
* is 10-byte wide.
*
*******************************************************************************/
void Cy_CapSense_CommonModeFilter_Lib(const uint16_t cmfThreshold,
                const uint16_t numSns,
                uint16_t * ptrSnsContext);

