zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_lib.h
/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseIsxInductance
****************************************************************************//**
*
* Returns inductance per resistance that corresponds to the provided parameters.
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns inductance divided by total resistance in 10^-10.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseIsxInductance(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseIsxFrequencyDivider
****************************************************************************//**
*
* Returns sense clock divider.
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns sense clock divider.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseIsxFrequencyDivider(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/*******************************************************************************
* Function Name: Cy_CapSense_GetSmartSenseIsxNumSubconversions
****************************************************************************//**
*
* Returns optimum number of sub-conversions.
*
* \param autoTuneConfig
* The configuration structure.
*
* \return
* Returns the calculated number of sub-conversions.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetSmartSenseIsxNumSubconversions(
                cy_stc_capsense_hw_smartsense_config_t * autoTuneConfig);

/** \} \endcond */

#if defined(__cplusplus)
}
#endif

#endif /* CY_CAPSENSE_LIB_H */


/* [] END OF FILE */
